Repository: seanpm2001/mt-training-data
Catalog: st/st_pontoon.tmx
Source language: en_us
Languages: st

source: The sentence has disrespectful or offensive language.
st: Polelo e na le puo e hlokang tlhompho kapa e hlabang.

source: The sentence must be grammatically correct.
st: Polelo e tlameha ho nepahala ho ya ka sebopeho-puo.

source: The sentence must be speakable.
st: Polelo e tlameha ho bueha.

source: The sentence must be spelled correctly.
st: Polelo e tlameha ho peletwa ka nepo.

source: The site is ready to be launched when it reaches 75% completion.
st: Sebaka sa marang-rang se loketse ho phatlalatswa ha se fihla ho phethwa hwa 75%.

source: The site will be back up as soon as possible. For the latest information, please join the <matrixLink>Matrix community chat</matrixLink> or visit <githubLink>GitHub</githubLink> or <discourseLink>our Discourse forums</discourseLink> to submit and monitor site experience issues.
st: Sebaka sa marang-rang se tla kgutla ka pele ka moo ho ka kgonahalang. Bakeng sa dintlha tsa morao, ka kopo ikopanye le <matrixLink>moqoqo wa setjhaba sa Matrix</matrixLink> kapa etela <githubLink>GitHub</githubLink> kapa <discourseLink>diforamo tsa rona tsa Discourse</discourseLink> ho romella le ho hlokomela ditaba tsa boiphihlelo ba sebaka sa marang-rang.

source: The TED-LIUM corpus was made from audio talks and their transcriptions available on the TED website.
st: TED-LIUM corpus e entswe ho tswa ho dipuo tsa audio mme dingodilweng tsa tsona di fumaneha marang-rang a TED.

source: The website text is translated into that language.
st: Mongolo wa sebaka sa Marang-rang o fetolelwa puong eo.

source: This is approximately the number of hours required to train a production speech-to-text system.
st: Ena e batla e le kakanyo ya palo ya dihora tse hlokahalang ho kwetlisa tlhahiso ya sistimi ya puo-ho-ya-ho-mongolo.

source: This is a use case driven segment containing data to power spoken digit recognition and yes / no detection.
st: Ena ke karolo e tsamaiswang ke use case e nang le data ho matlafatsa temoho ya palo e buuweng le temoho ya ee / tjhe.

source: This is our process for translating and adapting our content for many locales (languages).
st: Ena ke tshebetso ya rona ya ho fetolela le ho fetola ditaba tsa rona bakeng sa dibaka tse ngata (dipuo).

source: This page gives you an overview of all your submitted sentences. You may also delete already submitted sentences if needed, by marking the checkbox next to it and clicking on &quot;Delete selected sentences&quot; at the bottom. Please only remove sentences if absolutely necessary, for example if you noticed after the fact that a sentence is copyright protected.
st: Leqephe lena le o fa kakaretso ya dipolelo kaofela tseo o di rometseng. O ka boela wa hlakola dipolelo tse seng di rometswe ha ho hlokahala, ka ho tshwaya lebokose le haufi le tsona ebe o tobetsa&quot;Phumula dipolelo tse kgethilweng&quot; ka tlase. Ka kopo tlosa feela dipolelo ha ho hlokahala, mohlala haeba o hlokometse kamorao hore polelo e sireleditswe ke molao wa ditokelo tsa dingolwa.

source: This setting controls your leaderboard visibility. When hidden, your progress will be private. This means your image, user name and progress will not appear on the leaderboard. Note that leaderboard refresh takes ~{ $minutes }min to populate changes.
st: Tlhophiso ena e laola ponahalo ya boto-ya-baetapele. Ha e patehile, tswelopele ya hao e tla ba lekunutu. Hona ho bolela hore setshwantsho sa hao, lebitso la mosebedisi le tswelopele ya hao ha di na hlaha ho boto-ya-baetapele. Hlokomela hore ntjhafatso ya boto-ya-baetapele e nka ~{ $minutes } metsoso ho bontsha diphetoho.

source: Three to go!
st: Tse tharo tse tlang ho tsamaea!

source: Today
st: Kajeno

source: Today's Common Voice progress on clips recorded
st: Tshebetso ya kajeno ya Common Voice di-cliping tsa mantswe e rekotilwe

source: Today's Common Voice progress on clips validated
st: Tshebetso ya kajeno ya Common Voice di-cliping tsa mantswe e netefaditswe

source: Today's Progress
st: Tswelopele ya kajeno

source: To make it into the Common Voice dataset, a voice clip must be validated by two separate users.
st: Ho kengwa ka hara pokello ya data ya Common Voice, clip ya lentswe e tlameha ho netefatswa ke basebedisi ba babedi ba arohaneng.

source: To make the Common Voice dataset as useful as possible we have decided to only allow source text that is available under a Creative Commons (CC0) license. Using the CC0 standard means its more difficult to find and collect source text, but allows anyone to use the resulting voice data without usage restrictions or authorization from Mozilla. Ultimately, we want to make the multi-language dataset as useful as possible to everyone, including researchers, universities, startups, governments, social purpose organizations, and hobbyists.
st: Ho etsa hore pokello ya data ya Common Voice e be molemo ka moo ho ka kgonehang re nkile qeto ya ho dumella sengolwa-sa-mathomo se fumanehang feela tlasa laesense ya Creative Commons (CC0). Ho sebedisa maemo a CC0 ho bolela hore ho thata ho fumana le ho bokella sengolwa-sa-mathomo, empa ho dumella mang kapa mang ho sebedisa data ya mantswe ntle le dithibelo tsa tshebediso kapa tumello ho tswa ho Mozilla. Qetellong, re batla ho etsa hore pokello ya data ya puo tse ngata e be molemo haholo ka moo ho ka kgonehang ho bohle, ho kenyelletsa bafuputsi,diunivesithi, ba qalang dikgwebo, mebuso, mekgatlo ya merero ya setjhaba, le batho ba ratang ho itlosa bodutu.

source: Top Contributors
st: Bafani ba ka hodimo

source: Total
st: Kakaretso

source: Total Approved
st: Kakaretso e Amohetsweng

source: { $totalHours } hours is achievable in just over { $periodMonths } months if { $people } people record { $clipsPerDay } clips a day.
st: { $totalHours } dihora tse ka fihlellwang ka mora { $periodMonths } dikgwedi haeba{ $people } batho ba rekota{ $clipsPerDay } di-clip ka letsatsi.

source: { $totalInReview } sentences in review.
st: { $totalInReview } dipolelo tse ntsengdi hlahlojwa.

source: { $totalSentences } total sentences.
st: { $totalSentences } kakaretso ya dipolelo.

source: To the right we outline the benefits and clarify what information we make public. Use the links below to get started with a Common Voice account on your own device.
st: Ka ho le letona re hlalosa melemo le ho hlakisa hore na ke dintlha di feng tseo re di phatlalatsang. Sebedisa dikgokahano tse ka tlase ho qala ka ak'haonte ya Common Voice ho sesebediswa sa hao.

source: Toward next goal
st: Ho leba sepheong se latelang

source: Track progress here and on your stats page.
st: Sheba tswelopele mona le leqepheng la hao la dipalo palo.

source: Translate this page
st: Fetolela leqephe lena

source: <translateVideoLink>Watch our guide on how to use Pontoon.</translateVideoLink>
st: <translateVideoLink>Sheba tataiso ya rona ya ho sebedisa Pontoon.</translateVideoLink>

source: Translating the site
st: Ho fetolela sebaka sa marang-rang

source: Translation is from English, but you can see <strong>Suggestions</strong> in other languages. Click the <strong>Profile</strong> icon, then <strong>Settings</strong> link and add any languages you speak. At the bottom right-hand corner will be a list of translations called <strong>Locales</strong>. Translations show on the site after one day.
st: Phetolelo e tswa ho Sekgowa, empa o ka bona <strong>Ditlhahiso</strong> ka dipuo tse ding. Penya letshwao la<strong>Profaele</strong>, ebe sehokelo sa <strong>Ditlhophiso</strong> mme o kenye efeng kapa e feng ya dipuo tseo o di buang. Qetellong k'honeng ya letsoho le letona ho tla ba le lenane la diphetolelo tse bitswang <strong>Locales</strong>. Diphetolelo di bontshwa setsing sa marang-rang kamora letsatsi le le leng.

source: Translation of the Common Voice site happens on <strong>Pontoon</strong>.
st: Phetolelo ya sebaka sa marang rang sa Common Voice e etsahala ho <strong>Pontoon</strong>.

source: Typically megabytes
st: Ka tlwaelo ke megabytes

source: Understand contribution criteria
st: Utlwisisa mekgwa ya ho fana

source: Understand what to look for when listening to voice clips and help make your voice recordings richer too!
st: Utlwisisa seo o lokelang ho se sheba ha o mametse di-clip tsa mantswe mme o thuse ho etsa hore direkoto tsa hao tsa lentswe di be monate le ho feta!

source: Unexpected response returned from server
st: Karabelo e neng e sa lebellwa e kgutlisitswe ho tswa ho server

source: Unfortunately we can’t have Wikimedia articles yet. So do not copy paste from there.
st: Ka bomadimabe ha re kgone ho ba le dingodilweng tsa Wikimedia hajwale. Kahoo o se ke wa kopitsa ho tloha moo.

source: { $unreviewedSentencesByYou } sentences left for you to review.
st: { $unreviewedSentencesByYou } dipolelo tse setseng hore o di hlahlobe.

source: Updating…
st: E ntse e ntlafatsa...

source: Upload aborted. Do you want to delete your recordings?
st: Ho kenya ho fedisitswe. Na o batla ho hlakola direkoto tsa hao?

source: Upload an image file
st: Kenya faele ya setshwantsho

source: User Name
st: Lebitso la mosebedisi

source: Users validate the accuracy of donated clips, checking that the speaker read the sentence correctly.
st: Basebedisi ba netefatsa ho nepahala ha di-clip tse fanweng, ho lekola hore sebui se bala polelo ka nepo.

source: Using Common Voice
st: Ho Sebedisa Common Voice

source: Validated Clips
st: Di-clip tse netefaditsweng

source: Validated Hours
st: Dihora tse netefaditsweng

source: Validated Hr. Total
st: Kakaretso ya Dihora tse netefaditsweng

source: { $validatedSentences } validated sentences.
st: { $validatedSentences } dipolelo tse netefaditsweng.

source: Validating donated clips is equally important to the Common Voice mission. Take a listen and help us create quality open source voice data.
st: Ho netefatsa dikotwana tse fanweng ho bohlokwa ka ho lekana ho sepheo sa Common Voice. Mamela mme o re thuse ho etsa data ya mantswe e buletsweng bohle e nang le boleng.

source: Validation Progress
st: Kgatelo pele ya Netefatso

source: Validations
st: Dinetefatso

source: Value and recognition.
st: Boleng le temoho.

source: Variants are a specific form of a language - for example shared by those living in a geography or commmunity. Sometimes these are called dialects.
st: Variants ke mofuta o itseng wa puo - mohlala, e arolelalanwa ke ba phelang tikolohong kapa setjhabeng. Ka dinako tse ding tsena di bitswa maleme.

source: Varying Pronunciations
st: Qapodiso tse fapaneng

source: Version
st: Mofuta

source: View your progress against personal and project goals.
st: Sheba tswelopele ya hao kgahlanong le dipheo tsa hao le tsa morero.

source: Visible
st: E Bonahalang

source: Voice clips are entered into a submission queue that readies them for listening.
st: Di-clip tsa mantswe di kenngwa moleng wa phano e di lokisetsang hore di mamelwe.

source: Voice Contribution
st: Nehelano ya Lentswe

source: Voice Dataset, Ready for Download
st: Pokello ya Lentswe, Itokisetse ho download-a

source: Voice is natural, voice is human. That’s why we’re excited about creating usable voice technology for our machines. But to create voice systems, developers need an extremely large amount of voice data.
st: Lentswe ke la tlhaho, lentswe ke la motho. Ke ka lebaka leo re thabetseng ho etsa thekenoloji ya lentswe bakeng sa metjhini ya rona. Empa ho etsa ditsamaiso tsa mantswe, bahahi ba marang-rang ba hloka data ya mantswe e kgolo haholo.

source: Voice is natural, voice is human. That’s why we’re fascinated with creating usable voice technology for our machines. But to create voice systems, an extremely large amount of voice data is required.
st: Lentswe ke la tlhaho, lentswe ke la motho. Ke ka lebaka leo re hloletsweng ke ho etsa thekenoloji ya lentswe bakeng sa metjhini ya rona. Empa ho etsa ditsamaiso tsa mantswe, data e kgolo haholo e ya hlokahala.

source: Voice recognition technology is revolutionizing the way we interact with machines, but the currently available systems are expensive and proprietary. Common Voice is part of Mozilla’s initiative to make voice recognition technologies better and more accessible for everyone. Common Voice is a massive global database of donated voices that lets anyone quickly and easily train voice-enabled apps in potentially every language.
st: Thekenoloji e elellwang lentswe e fetola tsela yeo re sebedisanang le metjhini ka yona, empa ditsamaiso tse teng hona jwale di turu ebile di ruilwe ke batho ba itseng. Common Voice ke karolo ya boikitlaetso ba Mozilla ba ho etsa hore thekenoloji e elellwang lentswe e be betere le hore e fumanehe ho bohle. Common Voice ke database e kgolo haholo ya lefatshe ka bophara ya mantswe a nehetsweng e dumellang mang kapa mang hore a kwetlise ka potlako le ka bonolo disebediswa tse sebetsang ka lentswe ho puo e nngwe le e nngwe.

source: Voice recognition technology is revolutionizing the way we interact with machines, but the currently available systems are expensive and proprietary. Mozilla Common Voice is an initiative to make voice recognition technologies better and more accessible for everyone. Common Voice is a massive global database of donated voices that lets anyone quickly and easily train voice-enabled apps in potentially every language. We're not only collecting voice samples in widely spoken languages but also in those with a smaller population of speakers. Publishing a diverse dataset of voices will empower developers, entrepreneurs, and communities to address this gap themselves.
st: Thekenoloji e elellwang lentswe e fetola tsela yeo re sebedisanang le metjhini ka yona, empa ditsamaiso tse teng hona jwale di turu ebile di ruilwe ke batho ba itseng. Common Voice ke karolo ya boikitlaetso ba Mozilla ba ho etsa hore thekenoloji e elellwang lentswe e be betere le hore e fumanehe ho bohle. Common Voice ke database e kgolo haholo ya lefatshe ka bophara ya mantswe a nehetsweng e dumellang mang kapa mang hore a kwetlise ka potlako le ka bonolo disebediswa tse sebetsang ka lentswe ho puo e nngwe le e nngwe. Ha re bokelle feela mehlala ya mantswe a dipuo tse buuwang haholo empa le ho dipuo tse buuwang ke ditjhaba tse fokolang ka palo. Ho phatlalatsa pokello ya data e mefuta-futa ya mantswe ho tla matlafatsa dihahi tsa marang-rang, bahwebi, le ditjhaba kaofela tsa puo ho sebetsana le sekgeo sena ka bo bona.

source: Voices Online Now
st: Mantswe a Marang-rang Hona Jwale

source: Voice Validation
st: Netefatso ya Lentswe

source: Volume
st: Bophahamo ba modumo

source: VoxForge was set up to collect transcribed speech for use with Free and Open Source Speech Recognition Engines.
st: VoxForge e thehilwe ho bokella puo e ngotsweng hore e sebediswe le dienjene tsa Mahala mme tsa Mohlodi o Bulehileng wa Temoho ya Puo.

source: Want to help make Common Voice even better? Great! Get in touch via email or <discourseLink>Discourse</discourseLink> forums, submit site issues via <githubLink>GitHub</githubLink>, or join the <matrixLink>Matrix</matrixLink> community chat.
st: O batla ho thusa ho etsa Common Voice hore e be betere? Ke hantle! Ikopanye ka imeile kapa <discourseLink>Discourse</discourseLink> Dikopano, fana ka ditaba tsa sebaka sa marang-rang ka <githubLink>GitHub</githubLink>, kapa ikopanye le <matrixLink>Matrix</matrixLink> moqoqo wa setjhaba.

source: Want to stay in touch with Common Voice?
st: O batla ho dula o buisana le Common Voice?

source: Want updates when we release a new version of the Common Voice dataset? Subscribe to our newsletter.
st: Na o batla ditaba tsa morao-rao ha re lokolla mofuta o motjha wa pokello ya data ya Common Voice? Ngodisa ho koranta ya rona.

source: Watch our video explainer to help
st: Shebella setsebi sa rona sa video ho o thusa

source: We are building an open and publicly available dataset of voices that everyone can use to train speech-enabled applications.
st: Re aha pokello ya data e bulehileng le e fumanehang phatlalatsa ya mantswe eo motho e mong le e mong a ka e sebedisang ho kwetlisa diaplikeishene tse dumelang lentswe.

source: We are going out to get a coffee.
st: Re il'o fumana kofi.

source: We are going out to get coffee.
st: Re il'o fumana kofi.

source: We at Mozilla are building a community around voice technology. We would like to stay in touch with updates, new data sources and to hear more about how you're using this data.
st: Rona ba Mozilla re haha setjhaba mabapi le thekenoloji e sebetsang ka lentswe. Re ka lakatsa ho dula re tseba ka dintlafatso, mehlodi e metjha ya data le ho utlwa haholwanyane ka hore na o sebedisa data ena jwang.

source: We believe that large and publicly available voice datasets foster innovation and healthy commercial competition in machine-learning based speech technology. This is a global effort and we invite everyone to participate. Our aim is to help speech technology be more inclusive, reflecting the diversity of voices from around the world.
st: Re dumela hore dipokello tsa data tse kgolo le tse fumanehang phatlalatsa di kgothaletsa dintho tse ntjha le tlhodisano e ntle ya dikgwebo ho thekenoloji ya puo e thehilweng holima ho ithuta motjhini. Hona ke matsapa a lefatshe ka bophara mme re mema bohle ho nka karolo. Sepheo sa rona ke ho thusa thekenoloji ya puo e kenyelletse bongata, e bonahatse phapano ya mantswe a tswang lefatsheng.

source: We believe that large, publicly available voice datasets will foster innovation and healthy commercial competition in machine-learning based speech technology. Common Voice’s multi-language dataset is already the largest publicly available voice dataset of its kind, but it’s not the only one. Look to this page as a reference hub for other open source voice datasets and, as Common Voice continues to grow, a home for our release updates.
st: Re dumela hore dipokello tsa data tse kgolo le tse fumanehang phatlalatsa di kgothaletsa dintho tse ntjha le tlhodisano e ntle ya dikgwebo ho thekenoloji ya puo e thehilweng hodima ho ithuta motjhini. Pokello ya data ya dipuo tse ngata ya Common Voice e se ntse e le yona e kgolo ka ho fetisisa e fumanehang phatlalatsa ya mofuta wa yona, empa ha se yona feela. Sheba leqepheng lena e le setsi sa tshupiso bakeng sa dipokello tsa data tsa lentswe tse ding tse buletsweng setjhaba hape e le, ha Common Voice e ntse e tswela-pele ho hola, lehae la rona la tokollo ya dintlafatso.

source: Website Localization
st: Localization ya sebaka sa marang rang

source: We calculate hours by estimating the average length of each recording, and then multiplying that number by the total number of recordings across all languages.
st: Re bala dihora ka ho hakanya karolelano ya bolele ba rekoto ka nngwe, mme re ngatafatse nomoro eo ka kakaretso ya nomoro ya direkoto dipuong tsohle.

source: We could not fetch the stats. Please try again later.
st: Ha rea ​​kgona ho lata dipalo palo. Ka kopo leka hape hamorao.

source: We couldn’t find that page for you
st: Ha rea ​​o fumanela leqephe leo

source: We couldn’t get any audio clips for you to listen to. Please try again later.
st: Ha rea ​​kgona ho fumana di-clip tsa audio hore o ka di mamela. Ke kopa o leke hape hamorao.

source: We couldn’t get any sentences for you to speak. Please try again later.
st: "Ha rea ​​kgona ho o fumanela dipolelo tseo o ka di buang. Re kopa o leke hape hamorao"

source: Weekly
st: Beke le beke

source: Weekly Goal
st: Sepheo sa beke le beke

source: We failed to fetch available languages. Contributions are currently not possible. Please try again later.
st: Re hlotswe ho lata dipuo tse fumanehang. Menehelo ha e kgonehe hajwale. Ka kopo leka hape hamorao.

source: We launch the Common Voice site in this language.
st: Re qala sebaka sa marang rang sa Common Voice ka puo ena.

source: Welcome { $company } staff!
st: Amohela { $company } basebetsi!

source: Welcome to Common Voice
st: Rea o amohela ho Common Voice

source: Welcome to the Common Voice Sentence Collector
st: Rea o amohela ho MMokelli wa Dipolelo wa Common voice

source: We may not have received that request. Please email us directly on <emailLink>{ $email }</emailLink> and we will get back to you!
st: E ka nna yaba ha rea ​​fumana kopo eo. Ka kopo re romelle imeile ka ho toba ho <emailLink>{ $email }</emailLink> mme re tla kgutlela ho wena!

source: We prefer natural/conversational sentences. While phonetic diversity and different words in sentences is important, we are trying to make recording sentences as much fun as possible. Therefore it would be great if you could try to keep your sentences as natural/engaging as possible.
st: Re thabela dipolelo tsa tlhaho/moqoqo. Leha mefuta e fapaneng ya difonetiki le mantswe a fapaneng kahara dipolelo a le bohlokwa, re leka ho etsa ho rekota ha dipolelo ho be monate ka moo ho ka kgonehang. Kahoo ho ka ba hantle ha o ka leka ho etsa hore dipolelo tsa hao ebe tse hohelang kamoo ho ka kgonahalang.

source: We promise to handle your information with care. Read more in our <privacyLink>Privacy Notice</privacyLink>.
st: Re tshepisa ho sebetsana le ditaba tsa hao ka hloko. Bala haholwanyane ho <privacyLink>Tsebiso ya Lekunutu</privacyLink>.

source: We’re building an open source, multi-language dataset of voices that anyone can use to train speech-enabled applications.
st: Re theha pokello ya data ya mantswe ya dipuo tse ngata e mohlodi o bulehileng, eo mang kapa mang a ka e sebedisang ho kwetlisa diaplikeishene tse sebetsang ka puo.

source: We’re crowdsourcing an open-source dataset of voices. Donate your voice, validate the accuracy of other people’s clips, make the dataset better for everyone.
st: Re etsa pokello ya data ya mantswe e tswang ho batho ba bangata e buletsweng bohle. Nehela ka lentswe la hao, netefatsa nepahalo ya dikotwana tsa batho ba bang, etsa pokello ya data e betere bakeng sa bohle.

source: We’re experiencing unexpected downtime
st: Re tobane le nako e sa lebellwang ya ho se sebetse

source: We’re going out to get coffee.
st: Re il'o fumana kofi.

source: We release the dataset every 3 months.
st: Re lokolla dataset ka mor'a dikgwedi tse ding le tse ding tse 3.

source: We're receiving a lot of traffic and are currently investigating the issues.
st: Re fumana sephethephethe se sengata mme re ntse re etsa dipatlisiso hajwale.

source: We’re sorry, your platform is not currently supported.
st: Re maswabi, sethala sa hao ha se tshehetswe hajwale.

source: We use a Mozilla tool called <pontoonLink>Pontoon</pontoonLink> for translations. Pontoon has lots of languages, but if it doesn’t have yours you can <pontoonRequestLink>request for your language to be added</pontoonRequestLink>. Then, to make the language available on the Common Voice project, <githubRepoLink>request the new language on GitHub</githubRepoLink>. <localizationFragment>See more on site translation</localizationFragment>.
st: Re sebedisa sesebediswa sa Mozilla se bitswang <pontoonLink>Pontoon</pontoonLink> bakeng sa diphetolelo. Pontoon e na le dipuo tse ngata, empa ha e sena puo ya hao o ka <pontoonRequestLink>kopa hore puo ya hao e kenyelletswe</pontoonRequestLink>. Ebe, ho etsa hore puo e fumanehe ho morero wa Common Voice, <githubRepoLink>kopa puo e ntjha ho GitHub</githubRepoLink>. <localizationFragment>Sheba tse ding hape ho setsi sa marang-rang sa botoloki</localizationFragment>.

source: We've run out of clips to validate in this language...
st: Re feletswe ke di-clip tse lokelang ho netefatswa ho puo ena...

source: We've run out of sentences to record in this language...
st: Re feletswe ke dipolelo tseo re lokelang ho di rekota ka puo ena...

source: We want speech models to be better at understanding a diverse range of speakers. For this to happen, a voice dataset must represent lots of different people.
st: Re batla hore di-model tsa puo di be betere ho utlwisisa mefuta e fapaneng ya dibui. Ho re sena se etsahale, pokello ya data ya lentswe e tlameha ho emela batho ba bangata ba fapaneng.
